Tekla Open API Reference for Tekla Structures 2025
AnalysisObjectEnumerator.SelectInstances Property
 Gets or sets a value indicating whether the instance's Select() is called when the "Current" item is asked from the enumerator. The user can set this to "false" if no members are ever asked from the instance. This is the case when e.g. asking only a report property from this identifier. WARNING: normally the user should not change this value.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool SelectInstances { get; set; }
Public Property SelectInstances As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
AnalysisObjectEnumerator Class
Tekla.Structures.Analysis Namespace